import numpy as np

# a = np.array([2,23,4])
# print(a)
# # 输出：
# # [ 2 23  4] 输出没有逗号
#
# b = np.array([2,23,4],dtype=np.int)
# print(b.dtype)
# # 输出：
# # int32
#
# c = np.array([[2,23,4],
#               [2,32,4]])
# print('c的输出为：',c)
#
# d = np.zeros((3,4))
# print('d的输出为：\n',d)
#
# # d的输出为：
# #  [[0. 0. 0. 0.]
# #  [0. 0. 0. 0.]
# #  [0. 0. 0. 0.]]

# e = np.ones((3,4))
# print('e的输出为：\n',e)
# # e的输出为：
# #  [[1. 1. 1. 1.]
# #  [1. 1. 1. 1.]
# #  [1. 1. 1. 1.]]
#
# f = np.empty((3,4))
# print('f的输出为：\n',f)
# # f的输出为：
# #  [[1. 1. 1. 1.]
# #  [1. 1. 1. 1.]
# #  [1. 1. 1. 1.]]

f = np.arange(10,20,2)
print('f的输出为：\n',f)
# f的输出为：
#  [10 12 14 16 18]

f = np.arange(12).reshape((3,4))
print('f的输出为：\n',f)
# f的输出为：
#   [[ 0  1  2  3]
#  [ 4  5  6  7]
#  [ 8  9 10 11]]

f = np.linspace(1,10,5)
print('f的输出为：\n',f)
# f的输出为：
#  [ 1.    3.25  5.5   7.75 10.  ]

f = np.linspace(1,10,6).reshape((2,3))
print('f的输出为：\n',f)
# f的输出为：
#  [[ 1.   2.8  4.6]
#  [ 6.4  8.2 10. ]]

